In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [19]:
obj3 = Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = Series(sdata, states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002],
        'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]
        }
frame = DataFrame(data)

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
DataFrame(data, columns=['year', 'state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [6]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                    index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [12]:
frame2.ix['three']

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [17]:
frame2['debt'] = 16.5

In [19]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [20]:
frame2['debt'] = np.arange(5.)

In [21]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [22]:
val = Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [23]:
frame2['debt'] = val

In [24]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [25]:
frame2['estern'] = frame2.state == 'Ohio'

In [26]:
frame2

       year   state  pop  debt  estern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [27]:
del frame2['estern']

In [28]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [30]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [31]:
pop = {'Nevada': {2001:2.4, 2002:2.9}, 'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [32]:
frame3 = DataFrame(pop)

In [33]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [34]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [35]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [38]:
pdata = {'Ohio':frame3['Ohio'][:-1],
         'Nevada':frame3['Nevada'][:2]}

In [39]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [37]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [40]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [41]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [43]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [44]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [45]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [46]:
index[1:]

Index(['b', 'c'], dtype='object')

In [47]:
index[1]

'b'

In [48]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [50]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [52]:
obj2 = Series([1.5, -2.5, 0], index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [53]:
obj2.index is index

True

In [64]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [65]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [66]:
'Ohio' is frame3.columns #??

False

In [57]:
2003 in frame3.index

False

In [67]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [68]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [69]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [74]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [75]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [76]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'],
                  columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [77]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [79]:
states = ['Texas', 'Utah', 'California']

In [80]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [84]:
# frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', # ??
#             columns=states)

ValueError: index must be monotonic increasing or decreasing

In [87]:
# frame.ix[['a', 'c', 'd'], states]

In [90]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [91]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [92]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [93]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])

In [94]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [95]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [96]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [100]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [98]:
obj['b']

1.0

In [99]:
obj[1]

1.0

In [101]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [103]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [104]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [105]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [106]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [109]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [110]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [112]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [113]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [114]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [116]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
data.ix['Colorado', ['two', 'three']]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [118]:
data.ix[['Colorado', 'Utah'], [3,0,1]]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [119]:
data.ix[2]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [120]:
data.ix[:'Utah', 'two']

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [121]:
data.ix[data.three > 5, :3]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [122]:
s1 = Series([7.1, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [123]:
s1

a    7.1
c   -2.5
d    3.4
e    1.5
dtype: float64

In [124]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [125]:
s1+s2

a    5.0
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [126]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'),
               index =['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [127]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [128]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [129]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [130]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))

In [132]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [133]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [134]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [137]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [139]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [141]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [142]:
arr[0]

array([0., 1., 2., 3.])

In [143]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [145]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [146]:
series = frame.ix[0]
series

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [148]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [149]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [151]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [152]:
series3 = frame['d']

In [153]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [154]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [155]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [158]:
format = lambda x : '%.2f' % x

In [161]:
frame.applymap(format)

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [162]:
frame['e'].map(format)

Utah       2.00
Ohio       5.00
Texas      8.00
Oregon    11.00
Name: e, dtype: object

In [163]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [164]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [165]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'],
                 columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [166]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [167]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [168]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [212]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [213]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [173]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [210]:
obj.sort_values()

0     a
1     a
4     a
5     a
8     a
9     a
12    a
13    a
2     b
6     b
10    b
14    b
3     c
7     c
11    c
15    c
dtype: object

In [176]:
frame = DataFrame({'b': [4,7,-3,2],
                   'a': [0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [178]:
frame.sort_index(by='b')

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [180]:
frame.sort_index(by=['a', 'b'])

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [181]:
obj = Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [182]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [183]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [184]:
obj.rank(ascending=False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [185]:
frame = DataFrame({'b' : [4.3, 7, -3, 2], 'a':[0,1,0,1],
                   'c' : [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [186]:
frame.rank(axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [188]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [191]:
obj.index.is_unique

False

In [192]:
obj['a']

a    0
a    1
dtype: int64

In [193]:
obj['c']

4

In [194]:
df = DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.828118  1.949516 -0.404183
a  0.777826  0.647468  2.075624
b  0.994778 -0.101425  1.909379
b -0.601330  0.870254 -0.389138

In [195]:
df.ix['b']

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.994778 -0.101425  1.909379
b -0.601330  0.870254 -0.389138

In [197]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
                index = ['a', 'b', 'c', 'd'],
                columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [198]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [199]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [200]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [201]:
df.idxmax()

one    b
two    d
dtype: object

In [202]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [203]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [204]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [205]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [207]:
import pandas_datareader.data as web

In [209]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})

volum = DataFrame({tic: data['Volume']
                   for tic, data, in all_data.items()})

In [216]:
all_data

{'AAPL':                  High        Low       Open      Close       Volume  Adj Close
 Date
 1999-12-31   3.674107   3.553571   3.604911   3.671875   40952800.0   3.194901
 2000-01-03   4.017857   3.631696   3.745536   3.997768  133949200.0   3.478462
 2000-01-04   3.950893   3.613839   3.866071   3.660714  128094400.0   3.185191
 2000-01-05   3.948661   3.678571   3.705357   3.714286  194580400.0   3.231803
 2000-01-06   3.821429   3.392857   3.790179   3.392857  191993200.0   2.952128
 2000-01-07   3.607143   3.410714   3.446429   3.553571  115183600.0   3.091966
 2000-01-10   3.651786   3.383929   3.642857   3.491071  126266000.0   3.037585
 2000-01-11   3.549107   3.232143   3.426339   3.312500  110387200.0   2.882209
 2000-01-12   3.410714   3.089286   3.392857   3.113839  244017200.0   2.709354
 2000-01-13   3.526786   3.303571   3.374442   3.455357  258171200.0   3.006510
 2000-01-14   3.651786   3.549107   3.571429   3.587054   97594000.0   3.121099
 2000-01-18   3.785714   3.587054   3.607143   3.712054  114794400.0   3.229861
 2000-01-19   3.883929   3.691964   3.772321   3.805804  149410800.0   3.311433
 2000-01-20   4.339286   4.053571   4.125000   4.053571  457783200.0   3.527016
 2000-01-21   4.080357   3.935268   4.080357   3.975446  123981200.0   3.459039
 2000-01-24   4.026786   3.754464   3.872768   3.794643  110219200.0   3.301722
 2000-01-25   4.040179   3.656250   3.750000   4.008929  124286400.0   3.488172
 2000-01-26   4.078125   3.919643   3.928571   3.935268   91789600.0   3.424081
 2000-01-27   4.035714   3.821429   3.886161   3.928571   85036000.0   3.418254
 2000-01-28   3.959821   3.593750   3.863839   3.629464  105837200.0   3.158000
 2000-01-31   3.709821   3.375000   3.607143   3.705357  175420000.0   3.224035
 2000-02-01   3.750000   3.571429   3.714286   3.580357   79508800.0   3.115272
 2000-02-02   3.647321   3.464286   3.598214   3.529018  116048800.0   3.070602
 2000-02-03   3.723214   3.580357   3.582589   3.689732  118798400.0   3.210440
 2000-02-04   3.928571   3.700893   3.712054   3.857143  106330000.0   3.356104
 2000-02-07   4.080357   3.783482   3.857143   4.073661  110266800.0   3.544496
 2000-02-08   4.147321   3.973214   4.071429   4.102679  102160800.0   3.569745
 2000-02-09   4.183036   4.015625   4.075893   4.022321   74841200.0   3.499825
 2000-02-10   4.066964   3.928571   4.031250   4.053571   75745600.0   3.527016
 2000-02-11   4.075893   3.866071   4.058036   3.883929   53062800.0   3.379410
 ...               ...        ...        ...        ...          ...        ...
 2009-11-18  29.571428  29.142857  29.505714  29.422857   93580200.0  25.600855
 2009-11-19  29.230000  28.542856  29.230000  28.644285  135581600.0  24.923416
 2009-11-20  28.627142  28.251429  28.450001  28.559999  101666600.0  24.850084
 2009-11-23  29.428572  28.992857  29.000000  29.411428  118724200.0  25.590912
 2009-11-24  29.411428  28.985714  29.332857  29.205715   79609600.0  25.411919
 2009-11-25  29.378571  29.108572  29.342857  29.170000   71613500.0  25.380844
 2009-11-27  28.994286  28.338572  28.459999  28.655714   73814300.0  24.933365
 2009-11-30  28.811428  28.395714  28.730000  28.558571  106214500.0  24.848841
 2009-12-01  28.967142  28.118572  28.891428  28.138571  116440800.0  24.483395
 2009-12-02  28.774286  27.964285  28.422857  28.032858  178815000.0  24.391418
 2009-12-03  28.425714  28.038572  28.202858  28.068571  112179900.0  24.422493
 2009-12-04  28.554285  27.182858  28.528572  27.617144  206721200.0  24.029699
 2009-12-07  27.681429  26.954287  27.617144  26.992857  178689700.0  23.486513
 2009-12-08  27.478571  26.957144  27.051428  27.124287  172599700.0  23.600866
 2009-12-09  28.308571  27.187143  27.325714  28.257143  171195500.0  24.586569
 2009-12-10  28.528572  28.017143  28.500000  28.061428  122417400.0  24.416273
 2009-12-11  28.285715  27.632856  28.254286  27.809999  107443700.0  24.197510
 2009-12-14  28.204287  27.508572  27.910000  28.139999  123947600.0  24.484638
 2009-12-15  28.215714  27.610001  27.975714  27.738571  104864900.0  24.135363
 2009-12-16  28.071428  27.792856  27.871429  27.861429   88246200.0  24.242254
 2009-12-17  27.857143  27.285715  27.751429  27.408571   97209700.0  23.848227
 2009-12-18  27.928572  27.514286  27.595715  27.918571  152192600.0  24.291979
 2009-12-21  28.535715  27.952858  28.007143  28.318571  152976600.0  24.640015
 2009-12-22  28.692858  28.379999  28.491428  28.622858   87378900.0  24.904774
 2009-12-23  28.911428  28.687143  28.742857  28.871429   86381400.0  25.121056
 2009-12-24  29.907143  29.049999  29.078571  29.862858  125222300.0  25.983706
 2009-12-28  30.564285  29.944286  30.245714  30.230000  161141400.0  26.303152
 2009-12-29  30.388571  29.818571  30.375713  29.871429  111301400.0  25.991158
 2009-12-30  30.285715  29.758572  29.832857  30.234285  103021100.0  26.306877
 2009-12-31  30.478571  30.080000  30.447144  30.104286   88102700.0  26.193771

 [2516 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 1999-12-31  109.500000  106.625000  109.187500  107.875000   2870300.0
 2000-01-03  116.000000  111.875000  112.437500  116.000000  10347700.0
 2000-01-04  114.500000  110.875000  114.000000  112.062500   8227800.0
 2000-01-05  119.750000  112.125000  112.937500  116.000000  12733200.0
 2000-01-06  118.937500  113.500000  118.000000  114.000000   7971900.0
 2000-01-07  117.937500  110.625000  117.250000  113.500000  11856700.0
 2000-01-10  119.375000  115.375000  117.250000  118.000000   8540500.0
 2000-01-11  121.125000  116.625000  117.875000  119.000000   7873300.0
 2000-01-12  122.000000  118.250000  119.625000  119.500000   6803800.0
 2000-01-13  121.000000  115.750000  119.937500  118.250000   8489700.0
 2000-01-14  123.312500  117.500000  120.937500  119.625000  10956600.0
 2000-01-18  119.750000  115.000000  119.687500  115.750000   7643900.0
 2000-01-19  122.000000  112.687500  115.562500  119.500000   8634500.0
 2000-01-20  124.750000  119.000000  123.000000  119.000000  17783400.0
 2000-01-21  123.000000  119.937500  121.875000  121.500000   7868700.0
 2000-01-24  122.875000  116.562500  121.875000  121.500000   6499200.0
 2000-01-25  119.500000  116.000000  116.750000  119.125000   6936900.0
 2000-01-26  119.937500  116.000000  119.062500  116.750000   4895100.0
 2000-01-27  118.437500  111.625000  118.000000  113.500000   8324600.0
 2000-01-28  114.187500  110.062500  112.750000  111.562500   6669400.0
 2000-01-31  112.812500  109.625000  111.375000  112.250000   6202700.0
 2000-02-01  113.437500  109.125000  112.375000  110.000000   7304700.0
 2000-02-02  115.812500  110.375000  112.000000  113.500000   7707700.0
 2000-02-03  117.500000  114.062500  115.000000  117.125000   6213800.0
 2000-02-04  118.437500  114.812500  118.187500  115.625000   5405300.0
 2000-02-07  116.875000  113.125000  116.000000  114.125000   5779500.0
 2000-02-08  119.000000  116.187500  116.937500  118.812500   5464300.0
 2000-02-09  119.750000  117.000000  119.000000  117.375000   5374700.0
 2000-02-10  119.125000  116.875000  117.687500  119.125000   4446600.0
 2000-02-11  119.437500  114.562500  119.062500  115.375000   5749400.0
 ...                ...         ...         ...         ...         ...
 2009-11-18  128.350006  127.550003  128.050003  128.149994   3970100.0
 2009-11-19  127.839996  126.510002  127.279999  127.540001   5308400.0
 2009-11-20  127.690002  126.459999  127.169998  126.959999   5354200.0
 2009-11-23  128.940002  127.650002  127.699997  128.199997   7003500.0
 2009-11-24  128.320007  127.139999  127.900002  127.930000   4816500.0
 2009-11-25  128.220001  127.080002  127.879997  127.279999   3967700.0
 2009-11-27  126.620003  124.260002  124.589996  125.699997   3319200.0
 2009-11-30  126.599998  124.919998  125.120003  126.349998   6302700.0
 2009-12-01  128.389999  126.849998  127.290001  127.940002   6578600.0
 2009-12-02  128.389999  127.160004  127.320000  127.209999   4597900.0
 2009-12-03  128.470001  127.250000  127.599998  127.550003   5760000.0
 2009-12-04  128.899994  126.000000  128.399994  127.250000   7068500.0
 2009-12-07  127.529999  126.589996  126.879997  127.040001   4144400.0
 2009-12-08  127.349998  126.160004  126.970001  126.800003   5351400.0
 2009-12-09  128.389999  126.110001  126.699997  128.389999   6071900.0
 2009-12-10  129.470001  128.089996  128.130005  129.339996   7077800.0
 2009-12-11  129.770004  128.710007  129.009995  129.679993   6597200.0
 2009-12-14  129.979996  129.600006  129.649994  129.929993   5201300.0
 2009-12-15  129.860001  127.940002  129.460007  128.490005   7862600.0
 2009-12-16  129.600006  128.350006  128.740005  128.710007   6372500.0
 2009-12-17  128.559998  127.120003  128.000000  127.400002   5909500.0
 2009-12-18  128.389999  127.000000  127.970001  127.910004   9106600.0
 2009-12-21  128.940002  127.680000  127.800003  128.649994   4772500.0
 2009-12-22  129.979996  129.190002  129.300003  129.929993   5535500.0
 2009-12-23  130.000000  129.300003  129.699997  130.000000   4127600.0
 2009-12-24  130.570007  129.479996  129.889999  130.570007   4265100.0
 2009-12-28  132.309998  130.720001  130.990005  132.309998   5800400.0
 2009-12-29  132.369995  131.800003  132.279999  131.850006   4184200.0
 2009-12-30  132.679993  130.679993  131.229996  132.570007   3867000.0
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0

             Adj Close
 Date
 1999-12-31  71.059143
 2000-01-03  76.411232
 2000-01-04  73.817535
 2000-01-05  76.411232
 2000-01-06  75.093842
 2000-01-07  74.764435
 2000-01-10  77.728668
 2000-01-11  78.387405
 2000-01-12  78.716743
 2000-01-13  77.893379
 2000-01-14  78.799088
 2000-01-18  76.246574
 2000-01-19  78.716743
 2000-01-20  78.387405
 2000-01-21  80.034210
 2000-01-24  80.034210
 2000-01-25  78.469734
 2000-01-26  76.905312
 2000-01-27  74.764435
 2000-01-28  73.488174
 2000-01-31  73.941017
 2000-02-01  72.458939
 2000-02-02  74.764435
 2000-02-03  77.152298
 2000-02-04  76.164230
 2000-02-07  75.176178
 2000-02-08  78.346260
 2000-02-09  77.398392
 2000-02-10  78.552361
 2000-02-11  76.079529
 ...               ...
 2009-11-18  93.848289
 2009-11-19  93.401581
 2009-11-20  92.976807
 2009-11-23  93.884903
 2009-11-24  93.687180
 2009-11-25  93.211166
 2009-11-27  92.054070
 2009-11-30  92.530098
 2009-12-01  93.694496
 2009-12-02  93.159912
 2009-12-03  93.408905
 2009-12-04  93.189209
 2009-12-07  93.035400
 2009-12-08  92.859650
 2009-12-09  94.024033
 2009-12-10  94.719780
 2009-12-11  94.968781
 2009-12-14  95.151863
 2009-12-15  94.097290
 2009-12-16  94.258415
 2009-12-17  93.299042
 2009-12-18  93.672539
 2009-12-21  94.214439
 2009-12-22  95.151863
 2009-12-23  95.203102
 2009-12-24  95.620552
 2009-12-28  96.894806
 2009-12-29  96.557938
 2009-12-30  97.085197
 2009-12-31  95.862190

 [2516 rows x 6 columns],
 'MSFT':                  High        Low       Open      Close       Volume  Adj Close
 Date
 1999-12-31  58.875000  58.125000  58.750000  58.375000   12517600.0  37.556007
 2000-01-03  59.312500  56.000000  58.687500  58.281250   53228400.0  37.495686
 2000-01-04  58.562500  56.125000  56.781250  56.312500   54119000.0  36.229057
 2000-01-05  58.187500  54.687500  55.562500  56.906250   64059600.0  36.611080
 2000-01-06  56.937500  54.187500  56.093750  55.000000   54976600.0  35.384666
 2000-01-07  56.125000  53.656250  54.312500  55.718750   62013600.0  35.847076
 2000-01-10  56.843750  55.687500  56.718750  56.125000   44963600.0  36.108448
 2000-01-11  57.125000  54.343750  55.750000  54.687500   46743600.0  35.183617
 2000-01-12  54.437500  52.218750  54.250000  52.906250   66532400.0  34.037640
 2000-01-13  54.312500  50.750000  52.187500  53.906250   83144000.0  34.680992
 2000-01-14  56.968750  52.875000  53.593750  56.125000   73416400.0  36.108448
 2000-01-18  58.250000  55.875000  55.906250  57.656250   81483600.0  37.093582
 2000-01-19  55.750000  53.000000  55.250000  53.500000   97568200.0  34.419624
 2000-01-20  54.843750  52.937500  53.531250  53.000000   56349800.0  34.097942
 2000-01-21  53.625000  51.625000  53.500000  51.875000   68416200.0  33.374176
 2000-01-24  52.843750  50.406250  51.898438  50.625000   63597600.0  32.569977
 2000-01-25  51.937500  49.781250  50.500000  51.406250   59823200.0  33.072601
 2000-01-26  51.750000  49.562500  51.218750  49.687500   49365000.0  31.966843
 2000-01-27  50.593750  48.625000  49.945312  49.375000   63654800.0  31.765783
 2000-01-28  50.125000  48.625000  49.062500  49.125000   58225400.0  31.604940
 2000-01-31  49.093750  47.437500  48.812500  48.937500   73194200.0  31.484304
 2000-02-01  51.625000  48.843750  49.250000  51.468750   70196600.0  33.112812
 2000-02-02  51.968750  50.250000  51.218750  50.406250   49915600.0  32.429245
 2000-02-03  52.093750  50.062500  51.031250  51.812500   49186000.0  33.333958
 2000-02-04  54.000000  52.070312  52.187500  53.281250   55365400.0  34.278893
 2000-02-07  53.437500  52.125000  53.406250  53.312500   40005800.0  34.298992
 2000-02-08  55.000000  53.218750  53.218750  54.968750   56229000.0  35.364567
 2000-02-09  54.718750  51.937500  54.718750  52.000000   55090000.0  33.454590
 2000-02-10  53.281250  51.250000  51.945312  53.000000   54527800.0  34.097942
 2000-02-11  52.437500  49.562500  52.437500  49.968750  115559000.0  32.147770
 ...               ...        ...        ...        ...          ...        ...
 2009-11-18  30.139999  29.809999  30.000000  30.110001   59431200.0  23.699564
 2009-11-19  30.000000  29.700001  29.990000  29.780001   51967700.0  23.439819
 2009-11-20  29.770000  29.430000  29.660000  29.620001   42647100.0  23.313887
 2009-11-23  30.010000  29.700001  29.840000  29.940001   41832700.0  23.565754
 2009-11-24  29.990000  29.750000  29.950001  29.910000   37341400.0  23.542145
 2009-11-25  29.860001  29.580000  29.809999  29.790001   32033500.0  23.447691
 2009-11-27  29.389999  28.750000  29.110001  29.219999   29357900.0  22.999046
 2009-11-30  29.450001  29.000000  29.150000  29.410000   44172000.0  23.148586
 2009-12-01  30.049999  29.410000  29.520000  30.010000   49904200.0  23.620857
 2009-12-02  29.990000  29.650000  29.900000  29.780001   36308600.0  23.439819
 2009-12-03  30.200001  29.760000  29.840000  29.830000   43095200.0  23.479172
 2009-12-04  30.370001  29.830000  30.049999  29.980000   58810700.0  23.597242
 2009-12-07  30.080000  29.680000  29.780001  29.790001   38082700.0  23.447691
 2009-12-08  29.740000  29.379999  29.520000  29.570000   37402200.0  23.274527
 2009-12-09  29.809999  29.250000  29.469999  29.709999   44713300.0  23.384720
 2009-12-10  29.959999  29.660000  29.709999  29.870001   45940200.0  23.510660
 2009-12-11  30.000000  29.790001  29.969999  29.850000   43744200.0  23.494911
 2009-12-14  30.160000  29.900000  29.910000  30.110001   34651200.0  23.699564
 2009-12-15  30.209999  29.879999  29.889999  30.020000   49473200.0  23.628725
 2009-12-16  30.410000  30.040001  30.070000  30.100000   55737800.0  23.691690
 2009-12-17  29.959999  29.570000  29.950001  29.600000   43691200.0  23.298141
 2009-12-18  30.450001  29.799999  29.840000  30.360001   94118000.0  23.896334
 2009-12-21  30.840000  30.370001  30.400000  30.520000   40129100.0  24.022272
 2009-12-22  30.930000  30.540001  30.600000  30.820000   36321000.0  24.258406
 2009-12-23  30.950001  30.690001  30.709999  30.920000   28362700.0  24.337109
 2009-12-24  31.000000  30.760000  30.879999  31.000000   11083900.0  24.400082
 2009-12-28  31.180000  30.889999  31.000000  31.170000   25384000.0  24.533884
 2009-12-29  31.500000  31.230000  31.350000  31.389999   29716200.0  24.707052
 2009-12-30  31.290001  30.799999  31.150000  30.959999   42006200.0  24.368599
 2009-12-31  30.990000  30.480000  30.980000  30.480000   31929700.0  23.990791

 [2516 rows x 6 columns],
 'GOOG':                   High         Low        Open       Close    Volume  \
 Date
 2004-08-19   51.835709   47.800831   49.813286   49.982655  44871300
 2004-08-20   54.336334   50.062355   50.316402   53.952770  22942800
 2004-08-23   56.528118   54.321388   55.168217   54.495735  18342800
 2004-08-24   55.591629   51.591621   55.412300   52.239193  15319700
 2004-08-25   53.798351   51.746044   52.284027   52.802086   9232100
 2004-08-26   53.773445   52.134586   52.279045   53.753517   7128600
 2004-08-27   54.107193   52.647663   53.848164   52.876804   6241200
 2004-08-30   52.548038   50.814533   52.443428   50.814533   5221400
 2004-08-31   51.661362   50.889256   50.958992   50.993862   4941200
 2004-09-01   51.292744   49.648903   51.158245   49.937820   9181600
 2004-09-02   50.993862   49.285267   49.409801   50.565468  15190400
 2004-09-03   50.680038   49.474556   50.286514   49.818268   5176800
 2004-09-07   50.809555   49.619015   50.316402   50.600338   5875200
 2004-09-08   51.322632   50.062355   50.181908   50.958992   5009200
 2004-09-09   51.163227   50.311420   51.073563   50.963974   4080900
 2004-09-10   53.081039   50.460861   50.610302   52.468334   8740200
 2004-09-13   54.002586   53.031227   53.115910   53.549286   7881300
 2004-09-14   55.790882   53.195610   53.524376   55.536835  10880300
 2004-09-15   56.901718   54.894241   55.073570   55.790882  10763900
 2004-09-16   57.683788   55.616535   55.960247   56.772205   9310200
 2004-09-17   58.525631   56.562988   56.996365   58.525631   9517400
 2004-09-20   60.572956   58.166977   58.256641   59.457142  10679200
 2004-09-21   59.985161   58.535595   59.681301   58.699978   7263000
 2004-09-22   59.611561   58.186901   58.480801   58.968971   7617100
 2004-09-23   61.086033   58.291508   59.198112   60.184414   8576100
 2004-09-24   61.818291   59.656395   60.244190   59.691261   9166700
 2004-09-27   60.214302   58.680054   59.556767   58.909195   7099600
 2004-09-28   63.462128   59.880554   60.423519   63.193138  17009400
 2004-09-29   67.257904   62.879314   63.113434   65.295258  30661400
 2004-09-30   65.902977   64.259140   64.707458   64.558022  13823300
 ...                ...         ...         ...         ...       ...
 2009-11-18  288.309357  284.966888  287.248322  287.248322   3110700
 2009-11-19  285.928284  283.935730  285.813690  285.425171   4352200
 2009-11-20  284.732758  283.636871  283.686676  283.915802   4027400
 2009-11-23  292.204742  286.854797  287.168610  290.087677   5114000
 2009-11-24  291.054047  287.193542  290.172363  290.456299   3222400
 2009-11-25  292.433899  290.257050  292.110107  291.776337   2933300
 2009-11-27  290.142487  284.418915  284.932007  288.797516   2779500
 2009-11-30  290.745209  287.477478  289.230896  290.411469   3463000
 2009-12-01  294.506104  290.411469  292.966888  293.833649   4657900
 2009-12-02  295.397766  292.015442  294.396515  292.658051   3338800
 2009-12-03  294.620697  291.407745  293.420197  291.776337   2868000
 2009-12-04  296.304382  288.508606  295.402771  291.412720   5046000
 2009-12-07  293.245850  289.415192  291.014221  292.030396   3284500
 2009-12-08  294.227173  289.913330  290.660522  292.428894   3059300
 2009-12-09  293.564636  290.700378  292.653076  293.410217   3575200
 2009-12-10  296.244598  294.102631  294.117584  294.645599   3349000
 2009-12-11  296.264526  292.767639  296.229645  294.152435   3452800
 2009-12-14  297.539734  295.198517  296.563416  296.752686   3841100
 2009-12-15  297.076477  294.391541  295.542236  295.462524   4577800
 2009-12-16  299.064026  297.205994  298.182343  297.763916   5639800
 2009-12-17  297.704132  295.771362  297.106384  295.861053   5297300
 2009-12-18  298.346710  296.389069  296.902130  297.096405   7089400
 2009-12-21  298.800018  296.722809  297.689178  298.222198   5161600
 2009-12-22  299.626923  298.306885  299.547211  299.437622   3775600
 2009-12-23  305.290710  300.299408  300.623199  304.697906   4160800

In [218]:
price

                 AAPL        IBM       MSFT        GOOG
Date
1999-12-31   3.194901  71.059143  37.556007         NaN
2000-01-03   3.478462  76.411232  37.495686         NaN
2000-01-04   3.185191  73.817535  36.229057         NaN
2000-01-05   3.231803  76.411232  36.611080         NaN
2000-01-06   2.952128  75.093842  35.384666         NaN
2000-01-07   3.091966  74.764435  35.847076         NaN
2000-01-10   3.037585  77.728668  36.108448         NaN
2000-01-11   2.882209  78.387405  35.183617         NaN
2000-01-12   2.709354  78.716743  34.037640         NaN
2000-01-13   3.006510  77.893379  34.680992         NaN
2000-01-14   3.121099  78.799088  36.108448         NaN
2000-01-18   3.229861  76.246574  37.093582         NaN
2000-01-19   3.311433  78.716743  34.419624         NaN
2000-01-20   3.527016  78.387405  34.097942         NaN
2000-01-21   3.459039  80.034210  33.374176         NaN
2000-01-24   3.301722  80.034210  32.569977         NaN
2000-01-25   3.488172  78.469734  33.072601         NaN
2000-01-26   3.424081  76.905312  31.966843         NaN
2000-01-27   3.418254  74.764435  31.765783         NaN
2000-01-28   3.158000  73.488174  31.604940         NaN
2000-01-31   3.224035  73.941017  31.484304         NaN
2000-02-01   3.115272  72.458939  33.112812         NaN
2000-02-02   3.070602  74.764435  32.429245         NaN
2000-02-03   3.210440  77.152298  33.333958         NaN
2000-02-04   3.356104  76.164230  34.278893         NaN
2000-02-07   3.544496  75.176178  34.298992         NaN
2000-02-08   3.569745  78.346260  35.364567         NaN
2000-02-09   3.499825  77.398392  33.454590         NaN
2000-02-10   3.527016  78.552361  34.097942         NaN
2000-02-11   3.379410  76.079529  32.147770         NaN
...               ...        ...        ...         ...
2009-11-18  25.600855  93.848289  23.699564  287.248322
2009-11-19  24.923416  93.401581  23.439819  285.425171
2009-11-20  24.850084  92.976807  23.313887  283.915802
2009-11-23  25.590912  93.884903  23.565754  290.087677
2009-11-24  25.411919  93.687180  23.542145  290.456299
2009-11-25  25.380844  93.211166  23.447691  291.776337
2009-11-27  24.933365  92.054070  22.999046  288.797516
2009-11-30  24.848841  92.530098  23.148586  290.411469
2009-12-01  24.483395  93.694496  23.620857  293.833649
2009-12-02  24.391418  93.159912  23.439819  292.658051
2009-12-03  24.422493  93.408905  23.479172  291.776337
2009-12-04  24.029699  93.189209  23.597242  291.412720
2009-12-07  23.486513  93.035400  23.447691  292.030396
2009-12-08  23.600866  92.859650  23.274527  292.428894
2009-12-09  24.586569  94.024033  23.384720  293.410217
2009-12-10  24.416273  94.719780  23.510660  294.645599
2009-12-11  24.197510  94.968781  23.494911  294.152435
2009-12-14  24.484638  95.151863  23.699564  296.752686
2009-12-15  24.135363  94.097290  23.628725  295.462524
2009-12-16  24.242254  94.258415  23.691690  297.763916
2009-12-17  23.848227  93.299042  23.298141  295.861053
2009-12-18  24.291979  93.672539  23.896334  297.096405
2009-12-21  24.640015  94.214439  24.022272  298.222198
2009-12-22  24.904774  95.151863  24.258406  299.437622
2009-12-23  25.121056  95.203102  24.337109  304.697906
2009-12-24  25.983706  95.620552  24.400082  308.085236
2009-12-28  26.303152  96.894806  24.533884  310.272034
2009-12-29  25.991158  96.557938  24.707052  308.543518
2009-12-30  26.306877  97.085197  24.368599  310.202271
2009-12-31  26.193771  95.862190  23.990791  308.832428

[2516 rows x 4 columns]

In [221]:
volum

                   AAPL         IBM         MSFT       GOOG
Date
1999-12-31   40952800.0   2870300.0   12517600.0        NaN
2000-01-03  133949200.0  10347700.0   53228400.0        NaN
2000-01-04  128094400.0   8227800.0   54119000.0        NaN
2000-01-05  194580400.0  12733200.0   64059600.0        NaN
2000-01-06  191993200.0   7971900.0   54976600.0        NaN
2000-01-07  115183600.0  11856700.0   62013600.0        NaN
2000-01-10  126266000.0   8540500.0   44963600.0        NaN
2000-01-11  110387200.0   7873300.0   46743600.0        NaN
2000-01-12  244017200.0   6803800.0   66532400.0        NaN
2000-01-13  258171200.0   8489700.0   83144000.0        NaN
2000-01-14   97594000.0  10956600.0   73416400.0        NaN
2000-01-18  114794400.0   7643900.0   81483600.0        NaN
2000-01-19  149410800.0   8634500.0   97568200.0        NaN
2000-01-20  457783200.0  17783400.0   56349800.0        NaN
2000-01-21  123981200.0   7868700.0   68416200.0        NaN
2000-01-24  110219200.0   6499200.0   63597600.0        NaN
2000-01-25  124286400.0   6936900.0   59823200.0        NaN
2000-01-26   91789600.0   4895100.0   49365000.0        NaN
2000-01-27   85036000.0   8324600.0   63654800.0        NaN
2000-01-28  105837200.0   6669400.0   58225400.0        NaN
2000-01-31  175420000.0   6202700.0   73194200.0        NaN
2000-02-01   79508800.0   7304700.0   70196600.0        NaN
2000-02-02  116048800.0   7707700.0   49915600.0        NaN
2000-02-03  118798400.0   6213800.0   49186000.0        NaN
2000-02-04  106330000.0   5405300.0   55365400.0        NaN
2000-02-07  110266800.0   5779500.0   40005800.0        NaN
2000-02-08  102160800.0   5464300.0   56229000.0        NaN
2000-02-09   74841200.0   5374700.0   55090000.0        NaN
2000-02-10   75745600.0   4446600.0   54527800.0        NaN
2000-02-11   53062800.0   5749400.0  115559000.0        NaN
...                 ...         ...          ...        ...
2009-11-18   93580200.0   3970100.0   59431200.0  3110700.0
2009-11-19  135581600.0   5308400.0   51967700.0  4352200.0
2009-11-20  101666600.0   5354200.0   42647100.0  4027400.0
2009-11-23  118724200.0   7003500.0   41832700.0  5114000.0
2009-11-24   79609600.0   4816500.0   37341400.0  3222400.0
2009-11-25   71613500.0   3967700.0   32033500.0  2933300.0
2009-11-27   73814300.0   3319200.0   29357900.0  2779500.0
2009-11-30  106214500.0   6302700.0   44172000.0  3463000.0
2009-12-01  116440800.0   6578600.0   49904200.0  4657900.0
2009-12-02  178815000.0   4597900.0   36308600.0  3338800.0
2009-12-03  112179900.0   5760000.0   43095200.0  2868000.0
2009-12-04  206721200.0   7068500.0   58810700.0  5046000.0
2009-12-07  178689700.0   4144400.0   38082700.0  3284500.0
2009-12-08  172599700.0   5351400.0   37402200.0  3059300.0
2009-12-09  171195500.0   6071900.0   44713300.0  3575200.0
2009-12-10  122417400.0   7077800.0   45940200.0  3349000.0
2009-12-11  107443700.0   6597200.0   43744200.0  3452800.0
2009-12-14  123947600.0   5201300.0   34651200.0  3841100.0
2009-12-15  104864900.0   7862600.0   49473200.0  4577800.0
2009-12-16   88246200.0   6372500.0   55737800.0  5639800.0
2009-12-17   97209700.0   5909500.0   43691200.0  5297300.0
2009-12-18  152192600.0   9106600.0   94118000.0  7089400.0
2009-12-21  152976600.0   4772500.0   40129100.0  5161600.0
2009-12-22   87378900.0   5535500.0   36321000.0  3775600.0
2009-12-23   86381400.0   4127600.0   28362700.0  4160800.0
2009-12-24  125222300.0   4265100.0   11083900.0  1723800.0
2009-12-28  161141400.0   5800400.0   25384000.0  3408400.0
2009-12-29  111301400.0   4184200.0   29716200.0  2860200.0
2009-12-30  103021100.0   3867000.0   42006200.0  2942100.0
2009-12-31   88102700.0   4223400.0   31929700.0  2448700.0

[2516 rows x 4 columns]

In [223]:
returns = price.pct_change() # compute percent changes
returns

                AAPL       IBM      MSFT      GOOG
Date
1999-12-31       NaN       NaN       NaN       NaN
2000-01-03  0.088754  0.075319 -0.001606       NaN
2000-01-04 -0.084311 -0.033944 -0.033781       NaN
2000-01-05  0.014634  0.035137  0.010545       NaN
2000-01-06 -0.086538 -0.017241 -0.033498       NaN
2000-01-07  0.047368 -0.004387  0.013068       NaN
2000-01-10 -0.017588  0.039648  0.007291       NaN
2000-01-11 -0.051151  0.008475 -0.025613       NaN
2000-01-12 -0.059973  0.004201 -0.032571       NaN
2000-01-13  0.109678 -0.010460  0.018901       NaN
2000-01-14  0.038114  0.011628  0.041160       NaN
2000-01-18  0.034847 -0.032393  0.027283       NaN
2000-01-19  0.025256  0.032397 -0.072087       NaN
2000-01-20  0.065103 -0.004184 -0.009346       NaN
2000-01-21 -0.019273  0.021009 -0.021226       NaN
2000-01-24 -0.045480  0.000000 -0.024096       NaN
2000-01-25  0.056471 -0.019548  0.015432       NaN
2000-01-26 -0.018374 -0.019937 -0.033434       NaN
2000-01-27 -0.001702 -0.027838 -0.006290       NaN
2000-01-28 -0.076136 -0.017070 -0.005063       NaN
2000-01-31  0.020910  0.006162 -0.003817       NaN
2000-02-01 -0.033735 -0.020044  0.051724       NaN
2000-02-02 -0.014339  0.031818 -0.020644       NaN
2000-02-03  0.045541  0.031938  0.027898       NaN
2000-02-04  0.045372 -0.012807  0.028348       NaN
2000-02-07  0.056134 -0.012973  0.000586       NaN
2000-02-08  0.007124  0.042169  0.031067       NaN
2000-02-09 -0.019587 -0.012098 -0.054008       NaN
2000-02-10  0.007769  0.014909  0.019231       NaN
2000-02-11 -0.041850 -0.031480 -0.057193       NaN
...              ...       ...       ...       ...
2009-11-18 -0.005024 -0.003732  0.003667 -0.001455
2009-11-19 -0.026462 -0.004760 -0.010960 -0.006347
2009-11-20 -0.002942 -0.004548 -0.005373 -0.005288
2009-11-23  0.029812  0.009767  0.010803  0.021738
2009-11-24 -0.006994 -0.002106 -0.001002  0.001271
2009-11-25 -0.001223 -0.005081 -0.004012  0.004545
2009-11-27 -0.017631 -0.012414 -0.019134 -0.010209
2009-11-30 -0.003390  0.005171  0.006502  0.005589
2009-12-01 -0.014707  0.012584  0.020402  0.011784
2009-12-02 -0.003757 -0.005706 -0.007664 -0.004001
2009-12-03  0.001274  0.002673  0.001679 -0.003013
2009-12-04 -0.016083 -0.002352  0.005029 -0.001246
2009-12-07 -0.022605 -0.001650 -0.006338  0.002120
2009-12-08  0.004869 -0.001889 -0.007385  0.001365
2009-12-09  0.041766  0.012539  0.004735  0.003356
2009-12-10 -0.006926  0.007400  0.005386  0.004210
2009-12-11 -0.008960  0.002629 -0.000670 -0.001674
2009-12-14  0.011866  0.001928  0.008711  0.008840
2009-12-15 -0.014265 -0.011083 -0.002989 -0.004348
2009-12-16  0.004429  0.001712  0.002665  0.007789
2009-12-17 -0.016254 -0.010178 -0.016611 -0.006391
2009-12-18  0.018607  0.004003  0.025676  0.004175
2009-12-21  0.014327  0.005785  0.005270  0.003789
2009-12-22  0.010745  0.009950  0.009830  0.004076
2009-12-23  0.008684  0.000538  0.003244  0.017567
2009-12-24  0.034340  0.004385  0.002588  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004299 -0.012597 -0.015504 -0.004416

[2516 rows x 4 columns]

In [224]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034340  0.004385  0.002588  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004299 -0.012597 -0.015504 -0.004416

In [228]:
#The corr method of Series computes the correlation of the overlapping, non-NA,
#aligned-by-index values in two Series. Relatedly, cov computes the covariance:
print(returns.MSFT.corr(returns.IBM))
print(returns.MSFT.cov(returns.IBM))

0.4943578205296998
0.00021582116280168714

In [230]:
#DataFrames corr and cov methods, on the other hand, return a full correlation or
#covariance matrix as a DataFrame, respectively
print(returns.corr())
print(returns.cov())

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.412392  0.423598  0.470676
IBM   0.412392  1.000000  0.494358  0.390689
MSFT  0.423598  0.494358  1.000000  0.443586
GOOG  0.470676  0.390689  0.443586  1.000000
          AAPL       IBM      MSFT      GOOG
AAPL  0.001030  0.000254  0.000309  0.000303
IBM   0.000254  0.000369  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

In [231]:
returns.corrwith(returns.IBM)

AAPL    0.412392
IBM     1.000000
MSFT    0.494358
GOOG    0.390689
dtype: float64

In [234]:
returns.corrwith(volum)

AAPL   -0.057665
IBM    -0.006592
MSFT   -0.014228
GOOG    0.062647
dtype: float64

In [237]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [240]:
unique = obj.unique()
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [242]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [244]:
pd.value_counts(obj.values, sort = False)

c    3
a    3
d    1
b    2
dtype: int64

In [246]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [248]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [249]:
data = DataFrame({
    'Qu1' : [1,3,4,3,4],
    'Qu2' : [2,3,1,2,3],
    'Qu3' : [1,5,2,4,4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [252]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [256]:
string_data = Series(['aardvard', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvard
1    artichoke
2          NaN
3      avocado
dtype: object

In [258]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [260]:
string_data[0] = None

In [261]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [263]:
from numpy import nan as NA

In [265]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [267]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [269]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [270]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA],  [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [271]:
cleaned = data.dropna()

In [272]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [273]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [274]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [275]:
data.dropna(how='any')

     0    1    2
0  1.0  6.5  3.0

In [276]:
data[4] = NA

In [277]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [278]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [280]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.760667  0.281894 -0.399424
1 -1.998468 -1.111331 -0.362798
2  0.877654  0.223393 -0.329630
3 -0.086598  0.229403 -1.530145
4 -0.669860  0.211762  0.175547
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [281]:
df.ix[:4, 1] = NA

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [282]:
df.ix[:2, 2] = NA

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [283]:
df

          0         1         2
0 -0.760667       NaN       NaN
1 -1.998468       NaN       NaN
2  0.877654       NaN       NaN
3 -0.086598       NaN -1.530145
4 -0.669860       NaN  0.175547
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [284]:
df.dropna(thresh = 3)

          0         1         2
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [285]:
df.fillna(0)

          0         1         2
0 -0.760667  0.000000  0.000000
1 -1.998468  0.000000  0.000000
2  0.877654  0.000000  0.000000
3 -0.086598  0.000000 -1.530145
4 -0.669860  0.000000  0.175547
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [286]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.760667  0.500000       NaN
1 -1.998468  0.500000       NaN
2  0.877654  0.500000       NaN
3 -0.086598  0.500000 -1.530145
4 -0.669860  0.500000  0.175547
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [289]:
_ = df.fillna(0, inplace = True)
_

In [293]:
df

          0         1         2
0 -0.760667  0.000000  0.000000
1 -1.998468  0.000000  0.000000
2  0.877654  0.000000  0.000000
3 -0.086598  0.000000 -1.530145
4 -0.669860  0.000000  0.175547
5  1.969228  0.436276  0.471611
6  0.996592  1.005340  1.195480

In [295]:
df = DataFrame(np.random.randn(6,3))

In [296]:
df.ix[2:,1] = NA; df.ix[4:, 2] = NA

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [297]:
df

          0         1         2
0 -0.202233  1.246404 -0.228117
1  0.784715  0.897527 -0.136372
2  1.868686       NaN  0.474970
3  3.301444       NaN -0.394072
4 -1.539651       NaN       NaN
5  1.417937       NaN       NaN

In [298]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.202233  1.246404 -0.228117
1  0.784715  0.897527 -0.136372
2  1.868686  0.897527  0.474970
3  3.301444  0.897527 -0.394072
4 -1.539651  0.897527 -0.394072
5  1.417937  0.897527 -0.394072

In [299]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.202233  1.246404 -0.228117
1  0.784715  0.897527 -0.136372
2  1.868686  0.897527  0.474970
3  3.301444  0.897527 -0.394072
4 -1.539651       NaN -0.394072
5  1.417937       NaN -0.394072

In [301]:
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [303]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [304]:
data = Series(np.random.randn(10),
              index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -1.096203
   2    0.342046
   3    0.202084
b  1   -0.543292
   2   -2.138341
   3    0.409802
c  1    0.797205
   2    1.613980
d  2   -0.461433
   3   -1.160373
dtype: float64

In [305]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [306]:
data['b']

1   -0.543292
2   -2.138341
3    0.409802
dtype: float64

In [307]:
data['b':'c']

b  1   -0.543292
   2   -2.138341
   3    0.409802
c  1    0.797205
   2    1.613980
dtype: float64

In [308]:
data.ix[['b', 'd']]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -0.543292
   2   -2.138341
   3    0.409802
d  2   -0.461433
   3   -1.160373
dtype: float64

In [311]:
data[:, 2]

a    0.342046
b   -2.138341
c    1.613980
d   -0.461433
dtype: float64

In [312]:
data[:]

a  1   -1.096203
   2    0.342046
   3    0.202084
b  1   -0.543292
   2   -2.138341
   3    0.409802
c  1    0.797205
   2    1.613980
d  2   -0.461433
   3   -1.160373
dtype: float64

In [313]:
data.unstack()

          1         2         3
a -1.096203  0.342046  0.202084
b -0.543292 -2.138341  0.409802
c  0.797205  1.613980       NaN
d       NaN -0.461433 -1.160373

In [314]:
data.unstack().stack()

a  1   -1.096203
   2    0.342046
   3    0.202084
b  1   -0.543292
   2   -2.138341
   3    0.409802
c  1    0.797205
   2    1.613980
d  2   -0.461433
   3   -1.160373
dtype: float64

In [316]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                index = [['a', 'a', 'b', 'b'], [1,2,1,2]],
                columns = [['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [317]:
frame.index.names = ['key1', 'key2']

In [318]:
frame.columns.names = ['states', 'color']

In [319]:
frame

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [320]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [328]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                           names = ['states', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['states', 'color'])

In [324]:
frame.swaplevel('key1', 'key2')

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [329]:
frame.sort_index(1)

states    Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [330]:
frame.swaplevel(0,1).sort_index(0)

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [331]:
frame.sum(level='key2')

states  Ohio     Colorado
color  Green Red    Green
key2
1          6   8       10
2         12  14       16

In [332]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [335]:
frame = DataFrame({'a' : range(7), 'b': range(7,0,-1),
                  'c' : ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd' : [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [336]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [337]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [338]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [339]:
ser = Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [341]:
ser2 = Series(np.arange(3.), index = ['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [343]:
ser2[-1]

2.0

In [344]:
ser.ix[:1]

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [345]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [346]:
# ser3.iget_value(2) # ??

AttributeError: 'Series' object has no attribute 'iget_value'